andyvand/IOUSBFamily-630.4.5-AnV/UMCLogger/UMCLogger.cpp
/*
 * Copyright (c) 2008-2009 Apple Inc. All rights reserved.
 *
 * @APPLE_LICENSE_HEADER_START@
 * 
 * "Portions Copyright (c) 1999 Apple Inc.  All Rights
 * Reserved.  This file contains Original Code and/or Modifications of
 * Original Code as defined in and that are subject to the Apple Public
 * Source License Version 1.0 (the 'License').	You may not use this file
 * except in compliance with the License.  Please obtain a copy of the
 * License at http://www.apple.com/publicsource and read it before using
 * this file.
 * 
 * The Original Code and all software distributed under the License are
 * distributed on an 'AS IS' basis, WITHOUT WARRANTY OF ANY KIND, EITHER
 * EXPRESS OR IMPLIED, AND APPLE HEREBY DISCLAIMS ALL SUCH WARRANTIES,
 * INCLUDING WITHOUT LIMITATION, ANY WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE OR NON-INFRINGEMENT.  Please see the
 * License for the specific language governing rights and limitations
 * under the License."
 * 
 * @APPLE_LICENSE_HEADER_END@
 */

/*
g++ -W -Wall -I/System/Library/Frameworks/System.framework/PrivateHeaders -I/System/Library/Frameworks/Kernel.framework/PrivateHeaders -lutil -DPRIVATE -D__APPLE_PRIVATE -O -arch ppc -arch i386 -arch x86_64 -o UMCLogger UMCLogger.cpp
*/


//-----------------------------------------------------------------------------
//	Includes
//-----------------------------------------------------------------------------

#ifndef KERNEL_PRIVATE
#define KERNEL_PRIVATE 1
#endif /* KERNEL_PRIVATE */

#include <errno.h>
#include <getopt.h>
#include <signal.h>
#include <spawn.h>
#include <stdlib.h>
#include <stdio.h>
#include <stdint.h>
#include <string.h>
#include <unistd.h>

#ifdef _HAVE_LIBUTIL
#include <libutil.h>
#endif /* _HAVE_LIBUTIL */

#include <mach/clock_types.h>
#include <mach/mach_time.h>

#include <sys/types.h>
#include <sys/param.h>
#include <sys/sysctl.h>
#include <sys/time.h>
#include <sys/wait.h>

#include <sys/kdebug.h>

#if 0
#include <IOKit/scsi/IOSCSIArchitectureModelFamilyDebugging.h>
#endif /* 0 */

#include <IOKit/scsi/SCSICommandOperationCodes.h>

#include "IOUSBMassStorageClassTimestamps.h"
#include "../IOUSBFamily/Headers/USB.h"

#ifndef kd_buf
struct kd_buf_t {
    uint64_t	timestamp;
    uintptr_t	arg1;
    uintptr_t	arg2;
    uintptr_t	arg3;
    uintptr_t	arg4;
    uintptr_t	arg5;       /* will hold current thread */
    uint32_t	debugid;
#if defined(__LP64__)
    uint32_t	cpuid;
    uintptr_t	unused;
#endif
};

#define kd_buf struct kd_buf_t

typedef struct {
    unsigned int	type;
    unsigned int	value1;
    unsigned int	value2;
    unsigned int	value3;
    unsigned int	value4;
    
} kd_regtype;

typedef struct
{
    int		nkdbufs;
    int		nolog;
    int		flags;
    int		nkdthreads;
    int		bufid;
} kbufinfo_t;
#endif

#ifndef DEBUG
#define DEBUG 0
#endif /* DEBUG */

#ifndef KDBG_INIT
#define	KDBG_INIT 0x001
#endif /* KDBG_INIT */

#ifndef	KDBG_NOWRAP
#define	KDBG_NOWRAP 0x002
#endif /* KDBG_NOWRAP */

#ifndef	KDBG_FREERUN
#define	KDBG_FREERUN 0x004
#endif /* KDBG_FREERUN */

#ifndef KDBG_WRAPPED
#define	KDBG_WRAPPED 0x008
#endif /* KDBG_WRAPPED */

#ifndef KDBG_USERFLAGS
#define	KDBG_USERFLAGS (KDBG_FREERUN|KDBG_NOWRAP|KDBG_INIT)
#endif /* KDBG_USERFLAGS */

#ifndef KDBG_PIDCHECK
#define KDBG_PIDCHECK 0x010
#endif /* KDBG_PIDCHECK */

#ifndef KDBG_MAPINIT
#define KDBG_MAPINIT 0x020
#endif /* KDBG_MAPINIT */

#ifndef KDBG_PIDEXCLUDE
#define KDBG_PIDEXCLUDE 0x040
#endif /* KDBG_PIDEXCLUDE */

#ifndef KDBG_LOCKINIT
#define KDBG_LOCKINIT 0x080
#endif /* KDBG_LOCKINIT */

#ifndef KDBG_LP64
#define KDBG_LP64 0x100
#endif /* KDBG_LP64 */

#ifndef KDBG_CLASSTYPE
#define	KDBG_CLASSTYPE 0x10000
#endif /* KDBG_CLASSTYPE */

#ifndef KDBG_SUBCLSTYPE
#define	KDBG_SUBCLSTYPE 0x20000
#endif /* KDBG_SUBCLSTYPE */

#ifndef KDBG_RANGETYPE
#define	KDBG_RANGETYPE 0x40000
#endif /* KDBG_RANGETYPE */

#ifndef	KDBG_TYPENONE
#define	KDBG_TYPENONE 0x80000
#endif /* KDBG_TYPENONE */

#ifndef KDBG_CKTYPES
#define KDBG_CKTYPES 0xF0000
#endif /* KDBG_CKTYPES */

#ifndef KDBG_TIMESTAMP_MASK
#if !defined(__LP64__)
#define KDBG_TIMESTAMP_MASK 0x00ffffffffffffffULL
#else /* 64 bit */
#define KDBG_TIMESTAMP_MASK 0xffffffffffffffffULL
#endif /* 32/64 bit */
#endif /* KDBG_TIMESTAMP_MASK */

//-----------------------------------------------------------------------------
//	Structures
//-----------------------------------------------------------------------------

typedef struct ReturnCodeSpec
{
	unsigned int	returnCode;
	const char *	string;
} ReturnCodeSpec;


//-----------------------------------------------------------------------------
//	Constants
//-----------------------------------------------------------------------------

enum
{

	// Generic USB Storage					0x052D0000 - 0x052D03FF
	kAbortedTaskCode                        = UMC_TRACE ( kAbortedTask ),
	kCompleteSCSICommandCode				= UMC_TRACE ( kCompleteSCSICommand ),
	kNewCommandWhileTerminatingCode         = UMC_TRACE ( kNewCommandWhileTerminating ),
	kLUNConfigurationCompleteCode			= UMC_TRACE ( kLUNConfigurationComplete ),
	kIOUMCStorageCharacDictFoundCode		= UMC_TRACE ( kIOUMCStorageCharacDictFound ),
	kNoProtocolForDeviceCode				= UMC_TRACE ( kNoProtocolForDevice ),
	kIOUSBMassStorageClassStartCode         = UMC_TRACE ( kIOUSBMassStorageClassStart ),
	kIOUSBMassStorageClassStopCode          = UMC_TRACE ( kIOUSBMassStorageClassStop ),
	kAtUSBAddressCode						= UMC_TRACE ( kAtUSBAddress ),
	kMessagedCalledCode						= UMC_TRACE ( kMessagedCalled ),
	kWillTerminateCalledCode				= UMC_TRACE ( kWillTerminateCalled ),
	kDidTerminateCalledCode					= UMC_TRACE ( kDidTerminateCalled ),
	kCDBLog1Code							= UMC_TRACE ( kCDBLog1 ),
	kCDBLog2Code							= UMC_TRACE ( kCDBLog2 ),
	kClearEndPointStallCode					= UMC_TRACE ( kClearEndPointStall ),
	kGetEndPointStatusCode					= UMC_TRACE ( kGetEndPointStatus ),
	kHandlePowerOnUSBResetCode				= UMC_TRACE ( kHandlePowerOnUSBReset ),
	kUSBDeviceResetWhileTerminatingCode		= UMC_TRACE ( kUSBDeviceResetWhileTerminating ),
	kUSBDeviceResetAfterDisconnectCode		= UMC_TRACE ( kUSBDeviceResetAfterDisconnect ),
	kUSBDeviceResetReturnedCode				= UMC_TRACE ( kUSBDeviceResetReturned ),
	kAbortCurrentSCSITaskCode				= UMC_TRACE ( kAbortCurrentSCSITask ),
	kCompletingCommandWithErrorCode			= UMC_TRACE ( kCompletingCommandWithError ),
	kDeviceInformationCode                  = UMC_TRACE ( kDeviceInformation ),
    kSuspendPortCode                        = UMC_TRACE ( kSuspendPort ),
    kSubclassUseCode                        = UMC_TRACE ( kSubclassUse ),
    
	// CBI Specific							0x052D0400 - 0x052D07FF
	kCBIProtocolDeviceDetectedCode			= UMC_TRACE ( kCBIProtocolDeviceDetected ),
	kCBICommandAlreadyInProgressCode		= UMC_TRACE ( kCBICommandAlreadyInProgress ),
	kCBISendSCSICommandReturnedCode			= UMC_TRACE ( kCBISendSCSICommandReturned ),
	
	// UFI Specific							0x052D0800 - 0x052D0BFF

