andyvand/IOUSBFamily-630.4.5-AnV/UMCLogger/UMCLogger.cpp
            // No, they want logging. Start main loop.
            while ( 1 )
            {
                
                usleep ( 20 * kMicrosecondsPerMillisecond );
                CollectTrace ( );
                
            }
            
        }
        
        else
        {
            
            ParseTraceFile ( );
            
        }
		
	}
	
	return 0;
	
}


//-----------------------------------------------------------------------------
//	PrintUsage
//-----------------------------------------------------------------------------

static void
PrintUsage ( void )
{
	
	printf ( "\n" );
	
	printf ( "Usage: %s\n\n", gProgramName );
    printf ( "\t-h help\n" );
    printf ( "\t-b hide rejected SCSI tasks\n" );
    printf ( "\t-d disable\n" );
    printf ( "\t-f <file_path> write traces out directly to a file.\n" );
    printf ( "\t-r <file_path> parses trace file\n" );
				
	printf ( "\n" );
	
	exit ( 0 );
	
}


//-----------------------------------------------------------------------------
//	ParseArguments
//-----------------------------------------------------------------------------

static void
ParseArguments ( int argc, const char * argv[] )
{
	
	int 					c;
    struct option 			long_options[] =
    {
        { "disable",        no_argument,        0, 'd' },
        { "busy",           no_argument,        0, 'b' },
        { "file",           required_argument,  0, 'f' },
        { "read",           required_argument,  0, 'r' },
        { "help",           no_argument,        0, 'h' },
        { 0, 0, 0, 0 }
    };
    
	// If no args specified, enable all logging...
	if ( argc == 1 )
	{
		return;
	}
	
    while ( ( c = getopt_long ( argc, ( char * const * ) argv , "dbf:r:h?", long_options, NULL  ) ) != -1 )
	{
		
        switch ( c )
        {
            
            case 'd':
            {
                
                gSavedTraceMask = 0;
                gSetRemoveFlag = FALSE;
                Quit ( "Quit via user-specified trace disable\n" );
            
            }
            break;
                
            case 'b':
            {
                
                gHideBusyRejectedCommands = TRUE;
                break;
                
            }
                
            case 'f':
            {
                
                gWriteToTraceFile = TRUE;
                
                if ( optarg != NULL )
                {
                    
                    if ( strlcpy ( gTraceFilePath, optarg, sizeof ( gTraceFilePath ) ) >= sizeof ( gTraceFilePath ) )
                    {
                        Quit ( "The path length of raw file is too long\n" );
                    }
                    
                }
                
                else
                {
                    Quit ( "No file specified with -f argument\n");
                }
                
            }
            break;
                
            case 'r':
            {
                
                gReadTraceFile = TRUE;
                
                if ( optarg != NULL )
                {
                    
                    if ( strlcpy ( gTraceFilePath, optarg, sizeof ( gTraceFilePath ) ) >= sizeof ( gTraceFilePath ) )
                    {
                        Quit ( "The path length of raw file is too long\n" );
                    }
                    
                }
                
                else
                {
                    Quit ( "No file specified with -r argument\n");
                }
                
            }
            break;
            
            case 'h':
            {
                PrintUsage ( );
            }
            break;
                
            default:
            {
                
                PrintUsage ( );
                Quit ( "Invalid usage\n");
                
            }
            break;
            
        }
        
	}
	
}


//-----------------------------------------------------------------------------
//	RegisterSignalHandlers
//-----------------------------------------------------------------------------

static void
RegisterSignalHandlers ( void )
{
	
	signal ( SIGINT, SignalHandler );
	signal ( SIGQUIT, SignalHandler );
	signal ( SIGHUP, SignalHandler );
	signal ( SIGTERM, SignalHandler );
	
}


//-----------------------------------------------------------------------------
//	AllocateTraceBuffer
//-----------------------------------------------------------------------------

static void
AllocateTraceBuffer ( void )
{
	
	size_t	len;
	int		mib[3];
	
	// grab the number of cpus
	mib[0] = CTL_HW;
	mib[1] = HW_NCPU;
	mib[2] = 0;
	
	len = sizeof ( gNumCPUs );
	
	sysctl ( mib, 2, &gNumCPUs, &len, NULL, 0 );
	
	gTraceBuffer = ( kd_buf * ) malloc ( gNumCPUs * kTraceBufferSampleSize * sizeof ( kd_buf ) );
	if ( gTraceBuffer == NULL )
	{
		Quit ( "Can't allocate memory for tracing info\n" );
	}
			
}


//-----------------------------------------------------------------------------
//	SignalHandler
//-----------------------------------------------------------------------------

static void
SignalHandler ( int signal )
{

#pragma unused ( signal )
	
	EnableTraceBuffer ( 0 );
	RemoveTraceBuffer ( );
	exit ( 0 );
	
}


//-----------------------------------------------------------------------------
//	EnableTraceBuffer
//-----------------------------------------------------------------------------

static void
EnableTraceBuffer ( int val ) 
{
	
	int 		mib[6];
	size_t 		needed;
	
	mib[0] = CTL_KERN;
	mib[1] = KERN_KDEBUG;
	mib[2] = KERN_KDENABLE;		/* protocol */
	mib[3] = val;
	mib[4] = 0;
	mib[5] = 0;					/* no flags */
	
	if ( sysctl ( mib, 4, NULL, &needed, NULL, 0 ) < 0 )
		Quit ( "trace facility failure, KERN_KDENABLE\n" );
	
	if ( val )
		gTraceEnabled = TRUE;
	else
		gTraceEnabled = FALSE;
	
}


//-----------------------------------------------------------------------------
//	SetTraceBufferSize
//-----------------------------------------------------------------------------

static void
SetTraceBufferSize ( int nbufs ) 
{
	
	int 		mib[6];
	size_t 		needed;

	mib[0] = CTL_KERN;
	mib[1] = KERN_KDEBUG;
	mib[2] = KERN_KDSETBUF;
	mib[3] = nbufs;
	mib[4] = 0;
	mib[5] = 0;					/* no flags */
	
