andyvand/IOUSBFamily-630.4.5-AnV/UMCLogger/UMCLogger.cpp
        }
        break;
			
        case kBOCommandAlreadyInProgressCode:
        {
            
            if ( gHideBusyRejectedCommands == FALSE )
            {
                
                printf ( "[%10p] B0 - Unable to accept task %p, still working on previous request\n",
                        ( void * ) inTracePoint.arg1, ( void * ) inTracePoint.arg2 );
                
            }
            
        }
        break;
			
        case kBOSendSCSICommandReturnedCode:
        {
            
            errorString = StringFromReturnCode ( (int)inTracePoint.arg3 );
            printf ( "[%10p] BO - SCSI Task %p was sent with status %s (0x%x)\n",
                    ( void * ) inTracePoint.arg1, ( void * ) inTracePoint.arg2, errorString, ( unsigned int ) inTracePoint.arg3 );
            
        }
        break;
			
        case kBOPreferredMaxLUNCode:
        {
            
            printf ( "[%10p] BO - Preferred MaxLUN: %d\n",
                    ( void * ) inTracePoint.arg1, (int) inTracePoint.arg2 );
            
        }
        break;
			
        case kBOGetMaxLUNReturnedCode:
        {
            errorString = StringFromReturnCode ( (int) inTracePoint.arg2 );
            printf ( "[%10p] BO - GetMaxLUN returned: %s (0x%x), triedReset=%u, MaxLun: %d\n",
                    ( void * ) inTracePoint.arg1, errorString, ( unsigned int ) inTracePoint.arg2, ( unsigned int ) inTracePoint.arg4, ( unsigned int ) inTracePoint.arg3 );
            
        }
        break;
			
        case kBOCBWDescriptionCode:
        {
            
            printf ( "[%10p] BO - Request %p, LUN: %u, CBW Tag: %u (0x%x)\n",
                    ( void * ) inTracePoint.arg1, ( void * ) inTracePoint.arg2, ( unsigned int ) inTracePoint.arg3, ( unsigned int ) inTracePoint.arg4, ( unsigned int ) inTracePoint.arg4 );
            
        }
        break;
			
        case kBOCBWBulkOutWriteResultCode:
        {
            
            errorString = StringFromReturnCode ( (int)inTracePoint.arg2 );
            printf ( "[%10p] BO - Request %p, LUN: %u, Bulk-Out Write Status: %s (0x%x)\n",
                    ( void * ) inTracePoint.arg1, ( void * ) inTracePoint.arg4, ( unsigned int ) inTracePoint.arg3, errorString, ( unsigned int ) inTracePoint.arg2 );
            
        }
        break;
            
        case kBODoubleCompleteionCode:
        {
            
            printf ( "[%10p] BO - DOUBLE Completion\n", ( void * ) inTracePoint.arg1 );
            
        }
        break;
			
        case kBOCompletionDuringTerminationCode:
        {
            
            printf ( "[%10p] BO - Completion during termination\n", ( void * ) inTracePoint.arg1 );
            
        }
        break;
			
        case kBOCompletionCode:
        {
            errorString = StringFromReturnCode ( (unsigned int)(UInt64)inTracePoint.arg2 );
            printf ( "[%10p] BO - Completion, State: %s, Status: %s (0x%x), for Request: %p\n",
                    ( void * )(UInt64)inTracePoint.arg1, kBulkOnlyStateNames [ (int)(UInt64)inTracePoint.arg3 ],
                    errorString, (unsigned int)(UInt64)inTracePoint.arg2, (void *)(UInt64)inTracePoint.arg4 );
            
        }
        break;
			
        default:
        {
            
            if ( ( type >= 0x05278800 ) && ( type <= 0x05278BFC ) )
            {
                printf ( "[%10p] ??? - UNEXPECTED USB TRACE POINT - %p\n", (void *)(UInt64)inTracePoint.arg1, (void *)(UInt64)type );
            }
            
        }
        break;
			
    }
    
}


//-----------------------------------------------------------------------------
//	Quit
//-----------------------------------------------------------------------------

static void
Quit ( const char * s )
{
	
	USBSysctlArgs	args;
	int				error;
	
	if ( gTraceEnabled == TRUE )
		EnableTraceBuffer ( 0 );
	
	if ( gSetRemoveFlag == TRUE )
		RemoveTraceBuffer ( );
	
	args.type = kUSBTypeDebug;
	args.debugFlags = 0;
	
	error = sysctlbyname ( USBMASS_SYSCTL, NULL, NULL, &args, sizeof ( args ) );
	if ( error != 0 )
	{
		fprintf ( stderr, "sysctlbyname failed to set old UMC trace flags back\n" );
	}
	
	fprintf ( stderr, "%s: ", gProgramName );
	if ( s != NULL )
	{
		fprintf ( stderr, "%s", s );
	}
	
	exit ( 1 );
	
}


//-----------------------------------------------------------------------------
//	GetDivisor
//-----------------------------------------------------------------------------

static void
GetDivisor ( void )
{
	
	struct mach_timebase_info	mti;
	
	mach_timebase_info ( &mti );
	
	gDivisor = ( ( double ) mti.denom / ( double ) mti.numer) * 1000;
	
}


//-----------------------------------------------------------------------------
//	LoadUSBMassStorageExtension
//-----------------------------------------------------------------------------

static void
LoadUSBMassStorageExtension ( void )
{

	posix_spawn_file_actions_t	fileActions;
	char * const				argv[]	= { ( char * ) "/sbin/kextload", ( char * ) "/System/Library/Extensions/IOUSBMassStorageClass.kext", NULL };
	char * const				env[]	= { NULL };
	pid_t						child	= 0;
	union wait 					status;
	
	posix_spawn_file_actions_init ( &fileActions );
	posix_spawn_file_actions_addclose ( &fileActions, STDOUT_FILENO );
	posix_spawn_file_actions_addclose ( &fileActions, STDERR_FILENO );
	
	posix_spawn ( &child, "/sbin/kextload", &fileActions, NULL, argv, env );
	
	if ( !( ( wait4 ( child, ( int * ) &status, 0, NULL ) == child ) && ( WIFEXITED ( status ) ) ) )
	{
		printf ( "Error loading USB Mass Storage extension\n" );
	}	
	
	posix_spawn_file_actions_destroy ( &fileActions );

}


//-----------------------------------------------------------------------------
//	StringFromReturnCode
//-----------------------------------------------------------------------------

static const char * 
StringFromReturnCode ( unsigned int returnCode )
{
	
	const char *string = "UNKNOWN";
	unsigned int i;
	
	static ReturnCodeSpec sReturnCodeSpecs[] =
	{
		
		//	USB Return codes
		{ (unsigned int)kIOUSBUnknownPipeErr,								"kIOUSBUnknownPipeErr" },
		{ (unsigned int)kIOUSBTooManyPipesErr,							"kIOUSBTooManyPipesErr" },
		{ (unsigned int)kIOUSBNoAsyncPortErr,								"kIOUSBNoAsyncPortErr" },
		{ (unsigned int)kIOUSBNotEnoughPipesErr,							"kIOUSBNotEnoughPipesErr" },
		{ (unsigned int)kIOUSBNotEnoughPowerErr,							"kIOUSBNotEnoughPowerErr" },
		{ (unsigned int)kIOUSBEndpointNotFound,							"kIOUSBEndpointNotFound" },
		{ (unsigned int)kIOUSBConfigNotFound,								"kIOUSBConfigNotFound" },
		{ (unsigned int)kIOUSBTransactionTimeout,							"kIOUSBTransactionTimeout" },
		{ (unsigned int)kIOUSBTransactionReturned,						"kIOUSBTransactionReturned" },
		{ (unsigned int)kIOUSBPipeStalled,								"kIOUSBPipeStalled" },
		{ (unsigned int)kIOUSBInterfaceNotFound,							"kIOUSBInterfaceNotFound" },
		{ (unsigned int)kIOUSBLowLatencyBufferNotPreviouslyAllocated,		"kIOUSBLowLatencyBufferNotPreviouslyAllocated" },
		{ (unsigned int)kIOUSBLowLatencyFrameListNotPreviouslyAllocated,	"kIOUSBLowLatencyFrameListNotPreviouslyAllocated" },
		{ (unsigned int)kIOUSBHighSpeedSplitError,						"kIOUSBHighSpeedSplitError" },
		{ (unsigned int)kIOUSBSyncRequestOnWLThread,						"kIOUSBSyncRequestOnWLThread" },
		{ (unsigned int)kIOUSBDeviceNotHighSpeed,							"kIOUSBDeviceNotHighSpeed" },
		{ (unsigned int)kIOUSBLinkErr,									"kIOUSBLinkErr" },
		{ (unsigned int)kIOUSBNotSent2Err,								"kIOUSBNotSent2Err" },
		{ (unsigned int)kIOUSBNotSent1Err,								"kIOUSBNotSent1Err" },
		{ (unsigned int)kIOUSBBufferUnderrunErr,							"kIOUSBBufferUnderrunErr" },
		{ (unsigned int)kIOUSBBufferOverrunErr,							"kIOUSBBufferOverrunErr" },
		{ (unsigned int)kIOUSBReserved2Err,								"kIOUSBReserved2Err" },
		{ (unsigned int)kIOUSBReserved1Err,								"kIOUSBReserved1Err" },
		{ (unsigned int)kIOUSBWrongPIDErr,								"kIOUSBWrongPIDErr" },
		{ (unsigned int)kIOUSBPIDCheckErr,								"kIOUSBPIDCheckErr" },
		{ (unsigned int)kIOUSBDataToggleErr,								"kIOUSBDataToggleErr" },
		{ (unsigned int)kIOUSBBitstufErr,									"kIOUSBBitstufErr" },
		{ (unsigned int)kIOUSBCRCErr,										"kIOUSBCRCErr" },
		
		//	IOReturn codes
		{ (unsigned int)kIOReturnSuccess,									"kIOReturnSuccess" },
		{ (unsigned int)kIOReturnError,									"kIOReturnError" },
		{ (unsigned int)kIOReturnNoMemory,								"kIOReturnNoMemory" },
		{ (unsigned int)kIOReturnNoResources,								"kIOReturnNoResources" },
		{ (unsigned int)kIOReturnIPCError,								"kIOReturnIPCError" },
		{ (unsigned int)kIOReturnNoDevice,								"kIOReturnNoDevice" },
		{ (unsigned int)kIOReturnNotPrivileged,							"kIOReturnNotPrivileged" },
		{ (unsigned int)kIOReturnBadArgument,								"kIOReturnBadArgument" },
		{ (unsigned int)kIOReturnLockedRead,								"kIOReturnLockedRead" },
		{ (unsigned int)kIOReturnLockedWrite,								"kIOReturnLockedWrite" },
		{ (unsigned int)kIOReturnExclusiveAccess,							"kIOReturnExclusiveAccess" },
		{ (unsigned int)kIOReturnBadMessageID,							"kIOReturnBadMessageID" },
		{ (unsigned int)kIOReturnUnsupported,								"kIOReturnUnsupported" },
		{ (unsigned int)kIOReturnVMError,									"kIOReturnVMError" },
		{ (unsigned int)kIOReturnInternalError,							"kIOReturnInternalError" },
		{ (unsigned int)kIOReturnIOError,									"kIOReturnIOError" },
		{ (unsigned int)kIOReturnCannotLock,								"kIOReturnCannotLock" },
		{ (unsigned int)kIOReturnNotOpen,									"kIOReturnNotOpen" },
		{ (unsigned int)kIOReturnNotReadable,								"kIOReturnNotReadable" },
		{ (unsigned int)kIOReturnNotWritable,								"kIOReturnNotWritable" },
		{ (unsigned int)kIOReturnNotAligned,								"kIOReturnNotAligned" },
		{ (unsigned int)kIOReturnBadMedia,								"kIOReturnBadMedia" },
		{ (unsigned int)kIOReturnStillOpen,								"kIOReturnStillOpen" },
		{ (unsigned int)kIOReturnRLDError,								"kIOReturnRLDError" },
		{ (unsigned int)kIOReturnDMAError,								"kIOReturnDMAError" },
		{ (unsigned int)kIOReturnBusy,									"kIOReturnBusy" },
		{ (unsigned int)kIOReturnTimeout,									"kIOReturnTimeout" },
		{ (unsigned int)kIOReturnOffline,									"kIOReturnOffline" },
		{ (unsigned int)kIOReturnNotReady,								"kIOReturnNotReady" },
		{ (unsigned int)kIOReturnNotAttached,								"kIOReturnNotAttached" },
		{ (unsigned int)kIOReturnNoChannels,								"kIOReturnNoChannels" },
		{ (unsigned int)kIOReturnNoSpace,									"kIOReturnNoSpace" },
		{ (unsigned int)kIOReturnPortExists,								"kIOReturnPortExists" },
		{ (unsigned int)kIOReturnCannotWire,								"kIOReturnCannotWire" },
		{ (unsigned int)kIOReturnNoInterrupt,								"kIOReturnNoInterrupt" },
		{ (unsigned int)kIOReturnNoFrames,								"kIOReturnNoFrames" },
		{ (unsigned int)kIOReturnMessageTooLarge,							"kIOReturnMessageTooLarge" },
		{ (unsigned int)kIOReturnNotPermitted,							"kIOReturnNotPermitted" },
		{ (unsigned int)kIOReturnNoPower,									"kIOReturnNoPower" },
		{ (unsigned int)kIOReturnNoMedia,									"kIOReturnNoMedia" },
		{ (unsigned int)kIOReturnUnformattedMedia,						"kIOReturnUnformattedMedia" },
		{ (unsigned int)kIOReturnUnsupportedMode,							"kIOReturnUnsupportedMode" },
		{ (unsigned int)kIOReturnUnderrun,								"kIOReturnUnderrun" },
		{ (unsigned int)kIOReturnOverrun,									"kIOReturnOverrun" },
		{ (unsigned int)kIOReturnDeviceError,								"kIOReturnDeviceError" },
		{ (unsigned int)kIOReturnNoCompletion,							"kIOReturnNoCompletion" },
		{ (unsigned int)kIOReturnAborted,									"kIOReturnAborted" },
		{ (unsigned int)kIOReturnNoBandwidth,								"kIOReturnNoBandwidth" },
		{ (unsigned int)kIOReturnNotResponding,							"kIOReturnNotResponding" },
		{ (unsigned int)kIOReturnIsoTooOld,								"kIOReturnIsoTooOld" },
		{ (unsigned int)kIOReturnIsoTooNew,								"kIOReturnIsoTooNew" },
		{ (unsigned int)kIOReturnNotFound,								"kIOReturnNotFound" },
		{ (unsigned int)kIOReturnInvalid,									"kIOReturnInvalid" }
	};
	
	for ( i = 0; i < ( sizeof ( sReturnCodeSpecs ) / sizeof ( sReturnCodeSpecs[0] ) ); i++ )
	{
		
		if ( returnCode == sReturnCodeSpecs[i].returnCode )
		{
			
			string = sReturnCodeSpecs[i].string;
			break;
			
