andyvand/IOUSBFamily-630.4.5-AnV/UMCLogger/UMCLogger.cpp
		}
		
	}
	
	return string;
	
}


//-----------------------------------------------------------------------------
//	ProcessSubclassTracePoint
//-----------------------------------------------------------------------------

void
ProcessSubclassTracePoint ( kd_buf inTracePoint )
{
    
    UInt32 subclassID       = 0;
    UInt32 subclassCode     = 0;
    
    subclassID = ( inTracePoint.arg1 >> 24 ) & 0xFF;
    subclassCode = inTracePoint.arg1 & 0xFFFFFF;
    
    switch ( subclassID )
    {
            
        case kSubclassCode_AppleUSBODD:
        {
            ProcessAppleUSBODDSubclassTracePoint ( inTracePoint, subclassCode );
        }
        break;
            
        case kSubclassCode_AppleUSBCardReaderUMC:
        {
            ProcessAppleUSBCardReaderUMCSubclassTracePoint ( inTracePoint, subclassCode );
        }
        break;
            
        default:
        {
            printf ( "Recieved request for subclassID=0x%lx, but know of no such ssubclassID\n", ( unsigned long ) subclassID );
        }
        
    }
    
    return;
    
}


//-----------------------------------------------------------------------------
//	ProcessAppleUSBODDSubclassTracePoint
//-----------------------------------------------------------------------------

void
ProcessAppleUSBODDSubclassTracePoint ( kd_buf inTracePoint, UInt32 inSubclassCode )
{
    
    switch ( inSubclassCode )
    {
            
        case kAppleUSBODD_probe:
        {
            
            printf ( "[%10p] AUO - Probe returning instance %p\n",
                    ( void * ) inTracePoint.arg2, ( void * ) inTracePoint.arg3 );
            
        }
        break;
            
        case kAppleUSBODD_start:
        {
            
            printf ( "[%10p] AUO - Start returning %d\n",
                    ( void * ) inTracePoint.arg2, ( int ) inTracePoint.arg3 );
            
        }
        break;

        case kAppleUSBODD_requestedExtraPower:
        {
            
            printf ( "[%10p] AUO - BeginProvidedServices requested %ldma of extra power and was granted %ldma\n",
                    ( void * ) inTracePoint.arg2, ( unsigned long ) inTracePoint.arg3, ( unsigned long ) inTracePoint.arg4 );
            
        }
        break;
            
        case kAppleUSBODD_isMacModelSupported:
        {
            
            printf ( "[%10p] AUO - isMacModelSupported returning %d\n",
                    ( void * ) inTracePoint.arg2, ( int ) inTracePoint.arg3 );
            
        }
        break;
            
        case kAppleUSBODD_FindACPIPlatformDevice:
        {
            
            printf ( "[%10p] AUO - FindACPIPlatformDevice found device %p\n",
                    ( void * ) inTracePoint.arg2, ( void * ) inTracePoint.arg3 );
            
        }
        break;
            
        case kAppleUSBODD_CheckForACPIFlags:
        {
            
            printf ( "[%10p] AUO - CheckForACPIFlasgs found device 0x%lx\n",
                    ( void * ) inTracePoint.arg2, ( unsigned long ) inTracePoint.arg3 );
            
        }
        break;
            
        default:
        {
            printf ( "Recieved request for intSubclassCode=0x%lx for AppleUSBODD, but know of no such intSubclassCode\n", ( unsigned long )inSubclassCode );
        }
            
    }
    
}


//-----------------------------------------------------------------------------
//	ProcessAppleUSBCardReaderUMCSubclassTracePoint
//-----------------------------------------------------------------------------

void
ProcessAppleUSBCardReaderUMCSubclassTracePoint ( kd_buf inTracePoint, UInt32 inSubclassCode )
{
    
    switch ( inSubclassCode )
    {
           
        case kAppleUSBCardReaderUMC_HandlePowerChange:
        {
            
            printf ( "[%10p] AUCRU - HandlePowerChange current power state %d, requested power state %d\n",
                    ( void * ) inTracePoint.arg2, ( int ) inTracePoint.arg3, ( int ) inTracePoint.arg4 );
            
        }
        break;
            
        case kAppleUSBCardReaderUMC_start:
        {
            
            printf ( "[%10p] AUCRU - start returning %d\n",
                    ( void * ) inTracePoint.arg2, ( int ) inTracePoint.arg3  );
            
        }
        break;
        
        case kAppleUSBCardReaderUMC_stop:
        {
            printf ( "[%10p] AUCRU - stop fProposedPowerState=%lu fCurrentPowerState=%lu\n",
                    ( void * ) inTracePoint.arg2, ( unsigned long ) inTracePoint.arg3, ( unsigned long ) inTracePoint.arg4 );
        }
        break;
            
        case kAppleUSBCardReaderUMC_stop_2:
        {
            printf ( "[%10p] AUCRU - stop sleeptype=%lu fDeviceRequiresReset=%d\n",
                        ( void * ) inTracePoint.arg2, ( unsigned long ) inTracePoint.arg3, ( int ) inTracePoint.arg4 );
        }
        break;
            
        case kAppleUSBCardReaderUMC_message:
        {
            printf ( "[%10p] AUCRU - message type=0x%x argument=0x%x\n", ( void * ) inTracePoint.arg2,
                        ( int ) inTracePoint.arg3, ( int ) inTracePoint.arg4 );
        }
        break;
            
        case kAppleUSBCardReaderUMC_setProperty:
        {
            printf ( "[%10p] AUCRU - setProperty\n", ( void * ) inTracePoint.arg2 );
        }
        break;
            
        case kAppleUSBCardReaderUMC_gpioMediaDetectFired:
        {
            printf ( "[%10p] AUCRU - GPIO media detect\n", ( void * ) inTracePoint.arg2 );
        }
        break;
            
        case kAppleUSBCardReaderUMC_gpioMediaDetectEnable:
        {
            
            if ( inTracePoint.arg3 == 2 )
            {
                printf ( "[%10p] AUCRU - GPIO media detect SETUP and ENABLED IOIES=%p\n", ( void * ) inTracePoint.arg2, ( void * ) inTracePoint.arg4 );
            }
            
            else if ( inTracePoint.arg3 == 1 )
            {
                printf ( "[%10p] AUCRU - GPIO media detect ENABLED IOIES=%p\n", ( void * ) inTracePoint.arg2, ( void * ) inTracePoint.arg4 );
            }
            
            else
            {
                printf ( "[%10p] AUCRU - GPIO media detect DISABLED IOIES=%p\n", ( void * ) inTracePoint.arg2, ( void * ) inTracePoint.arg4 );
            }
            
